In [1]:
print("hi")
print("splitting")
print("hi")
print("splitting")

hi
splitting
hi
splitting

In [2]:
print("hello world")

hello world

In [3]:
7-5

2

In [4]:
7+2

9

In [5]:
7%2

1

In [6]:
7*2

14

In [7]:
7/2

3.5

In [8]:
7//2

3

In [9]:
7**2

49

In [10]:
7**2+3//5+3

52

In [11]:
7*2+5/2-1

15.5

In [12]:
7**6

117649

In [13]:
7**.6

3.2140958497160383

In [14]:
2+3//5+3

5

In [15]:
5//8

0

In [16]:
7**2

49

In [17]:
a=2
a

2

In [18]:
b=4.54

In [19]:
a+B

NameError: name 'B' is not defined

In [20]:
a+b

6.54

In [21]:
b/a

2.27

In [22]:
c=6.00
c/a

3.0

In [23]:
c*b

27.240000000000002

In [24]:
c='Hi'
print (c)

Hi

In [25]:
c="hi"
print (c)

hi

In [26]:
c

'hi'

In [27]:
a="hello"
b='lets try this one'
a + b

'hellolets try this one'

In [28]:
"hello blah'blah"

"hello blah'blah"

In [29]:
'hello "u"'

'hello "u"'

// INCOME TAX OF A PERSON

In [30]:
income=10000
tax=10%
income*tax

SyntaxError: invalid syntax (<ipython-input-30-8dd0ee99b5be>, line 2)

In [31]:
tax=10
income*tax/100

NameError: name 'income' is not defined

In [32]:
income=10000
tax=10
income*tax/100

1000.0

In [33]:
radius=5
pi=3.14
area = pi*radius**2
print("Area of a circle", area)

Area of a circle 78.5

In [34]:
round(45.7656766576567, 2)

45.77

In [35]:
round(234.343432, 2)

234.34

In [36]:
round(45.76567, 0)

46.0

In [37]:
int(round(45.76567, 0))

46

In [38]:
 int(area)

78

In [39]:
float(area)

78.5

In [40]:
45.7878.is_integer

In [41]:
'''jkkjkljkljk'''

'jkkjkljkljk'

In [42]:
round(45.76567, 0)

46.0

In [43]:
'''hjhkjhkj'''
area

78.5

In [44]:
story='I don't like to eat cheese'

SyntaxError: invalid syntax (<ipython-input-44-b8dd136b0275>, line 1)

In [45]:
story='I don\'t like to eat cheese'

In [46]:
story

"I don't like to eat cheese"

In [47]:
story="I don't like to eat "cheese""
story

SyntaxError: invalid syntax (<ipython-input-47-c2a26e4785db>, line 1)

In [48]:
story="I don't like to eat \"cheese\""
story

'I don\'t like to eat "cheese"'

In [49]:
story="I don\'t like to eat \"cheese\""
story

'I don\'t like to eat "cheese"'

In [50]:
story='I don\'t like to eat "cheese"'
story

'I don\'t like to eat "cheese"'

In [51]:
story='I don\'t like to eat "cheese"'
story

'I don\'t like to eat "cheese"'

In [52]:
a="jennifer"
b=" priya"
a+b

'jennifer priya'

In [53]:
print (c=a+b)

TypeError: 'c' is an invalid keyword argument for this function

In [54]:
c=a+b
c

'jennifer priya'

In [55]:
name="Jennifer"
age=30
stmt="My name is {one} and my age is {two}".format(one=name, two=age)
print (stmt)

My name is Jennifer and my age is 30

In [56]:
name="Jennifer"
age=30
stmt="My name is {} and my age is {}".format(name, age)
print (stmt)

My name is Jennifer and my age is 30

In [57]:
name="Jennifer"
age=30
stmt="My name is {0} and my age is {1}".format(name, age)
print (stmt)

My name is Jennifer and my age is 30

In [58]:
name="Jennifer"
age=30
stmt="My name is {1} and my age is {0}".format(name, age)
print (stmt)

My name is 30 and my age is Jennifer

In [59]:
hello * 3

NameError: name 'hello' is not defined

In [60]:
3* hello

NameError: name 'hello' is not defined

In [61]:
print(3*hello)

NameError: name 'hello' is not defined

In [62]:
3*"hello"

'hellohellohello'

In [63]:
"hello"*3

'hellohellohello'

In [64]:
'hello'*3\n

SyntaxError: unexpected character after line continuation character (<ipython-input-64-f9378ed2d272>, line 1)

In [65]:
'hello\n' * 3

'hello\nhello\nhello\n'

In [66]:
'hello' + '\n' * 3

'hello\n\n\n'

In [67]:
3 * 'hello' + '\n'

'hellohellohello\n'

In [68]:
    3 * ('hello' + '\n')

'hello\nhello\nhello\n'

In [69]:
"jennifer".upper()

'JENNIFER'

In [70]:
len("jennifer")

8

In [71]:
"Hi my name is Jennifer".replace("jennifer", "priya")

'Hi my name is Jennifer'

In [72]:
"Hi my name is Jennifer".replace("Jennifer", "priya")

'Hi my name is priya'

In [73]:
"jennifer".capitalize()

'Jennifer'

In [74]:
"JEnnIFER".lower()

'jennifer'

In [75]:
"JEnnIFER".capitalize()

'Jennifer'

In [76]:
stmt = "Hi my name is Jennifer! \n" * 10
xyz = stmt.replace("Jennifer", "Jennifer Priya")
print(xyz)

Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!
Hi my name is Jennifer Priya!

In [77]:
print(xyz.casefold())

hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!
hi my name is jennifer priya!

In [78]:
print(xyz.isalpha())

False

In [79]:
print(xyz.isalnum())

False

In [80]:
print(xyz.islower())

False

In [81]:
print(xyz.split(3,6))

TypeError: must be str or None, not int

In [82]:
print(xyz.split("Jennifer"))

['Hi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \nHi my name is ', ' Priya! \n']

In [83]:
print(xyz.rpartition("!"))

('Hi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya! \nHi my name is Jennifer Priya', '!', ' \n')

In [84]:
a="jen"
b="pri"
a<b

True

In [85]:
a>b

False

In [86]:
a==b

False

In [87]:
a<>b

SyntaxError: invalid syntax (<ipython-input-87-fee3b88270fa>, line 1)

In [88]:
4<>6

SyntaxError: invalid syntax (<ipython-input-88-2840abf8405f>, line 1)

In [89]:
a!=b

True

In [90]:
4!=6

True

In [91]:
4==4 AND 5!=6

SyntaxError: invalid syntax (<ipython-input-91-f6012e03fc30>, line 1)

In [92]:
(4==4) AND (5!=6)

SyntaxError: invalid syntax (<ipython-input-92-510705aefa2f>, line 1)

In [93]:
4==4 and 5!=6

True

In [94]:
4==4 or 5!=6

True

In [95]:
4==4 or 5==6

True

In [96]:
4==4 or 5==6

True

In [97]:
true or false

NameError: name 'true' is not defined

In [98]:
True or False

True

In [105]:
age=input("enter ur age")

enter ur age30

In [106]:
age

'30'

In [107]:
age=input("enter ur age")
age

enter ur age30

'30'

In [108]:
print(input("enter ur age"))

enter ur age30
30

In [109]:
radius=input("enter the radius")
pi=3.14
area = pi*radius**2
print(area)

enter the radius5

TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'int'

In [110]:
radius=int(input("enter the radius"))
pi=3.14
area = pi*radius**2
print(area)

enter the radius45
6358.5

In [111]:
radius=int(input("enter the radius"))
pi=3.14
area = pi*radius**2
print(area)

enter the radius5
78.5

In [112]:
radius=int(input("enter the radius"))
pi=3.14
print( pi*radius**2)

enter the radius5
78.5

In [113]:
a=int(input("Enter a"))
print("a = " , a)
b=int(input("Enter b"))
print("b = " , b)
print( (a+b)**2)

Enter a5
a =  5
Enter b7
b =  7
144

In [114]:
print("hi")

hi

In [115]:
salary=int(input("Enter your salary: "))
taxRate=int(input("Enter your tax slab: "))
tax=salary*taxRate/100
netSalary=salary - tax
print("Your net salary is: ", netSalary)
print("Your tax liability is: ", tax)

Enter your salary: 10000
Enter your tax slab: 10
Your net salary is:  9000.0
Your tax liability is:  1000.0

In [116]:
4**1.5

8.0

In [117]:
4**.5

2.0

In [118]:
9**.33

2.0649047728786885

In [119]:
9**(1/3)

2.080083823051904

In [120]:
27**(1/3)

3.0

In [121]:
print('Your net salary is ' + netSalary)

TypeError: must be str, not float

In [124]:
print('Your net salary is %s' %(netSalary))

Your net salary is 9000.0

In [125]:
print('Your net salary is %d' %(netSalary))

Your net salary is 9000

In [126]:
print('Your net salary is %f' %(netSalary))

Your net salary is 9000.000000

In [127]:
print('Your net salary is %1.3f' %(netSalary))

Your net salary is 9000.000

In [128]:
print('Your net salary is %1.0f' %(netSalary))

Your net salary is 9000

In [134]:
stmt = 'Your net salary is : \t %1.0f'
print(stmt %(netSalary))

Your net salary is : 	 9000

In [135]:
"hello"[4]

'o'

In [141]:
"hello"[2:4]

'll'

In [153]:
"hello"[2:]

'llo'

In [154]:
"hello"[:3]

'hel'

In [155]:
"hello"[0:7]

'hello'

In [156]:
"hello"[7:]

''

In [162]:
[1,2,3]

[1, 2, 3]

In [163]:
z=[1,2,3]

In [180]:
y=z.copy()
z.reverse()
print(y)
print(z)

[3, 2, 1]
[1, 2, 3]

In [182]:
a=[1,2]
b=['x', a]
b

['x', [1, 2]]

In [183]:
b[1][1]

2

In [184]:
b[1:]

[[1, 2]]

In [186]:
b[0]='y'
b

['y', [1, 2]]

In [209]:
name = {'one':'jen','two':'pri'}
name
name.keys()
name.values()
name.get('one')

'jen'

In [210]:
name.keys()

dict_keys(['one', 'two'])

In [212]:
name.get('one')

'jen'

In [214]:
y = {'x':[1,2,3]}
y.get('x')[1]

2

In [222]:
a = {'x':{1:'a',2:'b',3:'c'}}
a.get('x').get(1)

'a'

In [225]:
a.update({'x':{1:'z',2:'b',3:'c'}})
a

{'x': {1: 'z', 2: 'b', 3: 'c'}}

In [230]:
mylist = ['abc', 'xyz']
mylist

['abc', 'xyz']

In [232]:
mylist = mylist + ['pqr']
mylist

['abc', 'xyz', 'pqr']

In [235]:
mylist.append('def')
mylist

['abc', 'xyz', 'pqr', 'def']

In [237]:
mylist.pop(1)
mylist

['abc', 'pqr', 'def']

In [238]:
mylist.pop(0)

'abc'

In [239]:
mylist

['pqr', 'def']

In [240]:
mylist.sort()

In [241]:
mylist

['def', 'pqr']

In [245]:
mytup = (3,4,5)
mytup

(3, 4, 5)

In [246]:
mytup[1]

4

In [247]:
mytup[1]=7

TypeError: 'tuple' object does not support item assignment

In [248]:
max(mytup)

5

In [249]:
min(mytup)

3

In [255]:
sum(mytup)

12

In [258]:
4 in mytup

True

In [259]:
8 in mytup

False

In [266]:
set1 = {1,2,3}
set1

{1, 2, 3}

In [269]:
set1.add(4)
set1

{1, 2, 3, 4}

In [273]:
set2 = {'a','b','c'}
set1.union(set2)

{1, 2, 3, 4, 'a', 'b', 'c'}

In [274]:
set1

{1, 2, 3, 4}

In [275]:
set2

{'a', 'b', 'c'}

In [276]:
set1.update(set2)

In [277]:
set1

{1, 2, 3, 4, 'a', 'b', 'c'}

In [278]:
set2

{'a', 'b', 'c'}

In [279]:
set3 = {1,3,6,2,5,2,3}
set3

{1, 2, 3, 5, 6}

In [281]:
set3.difference()

{1, 2, 3, 5, 6}

In [283]:
set3

{1, 2, 3, 5, 6}

In [286]:
set3 = {1,3,6,2,5,2,3}
set3

{1, 2, 3, 5, 6}

In [289]:
myset = set()

In [291]:
myset.add(4)

In [293]:
myset=[3,2,5,3,4,5,6,3]
myset

[3, 2, 5, 3, 4, 5, 6, 3]

In [294]:
set(myset)

{2, 3, 4, 5, 6}

In [306]:
if 2==3:
    print('hi')
else:
       print('hello')

hello

In [316]:
if 2==3:
    print('hi')
elif 5==5:
    print('hello hi')
else:
    print('hello')

hello hi

In [320]:
taxSlab = {3:[10000,20000], 5:[20001,30000], 10:[30001,50000],20:[50001]}
taxSlab.get
salary=int(input("Enter your salary: "))


if salary > taxSlab.get(3)[0] and salary < taxSlab.get(3)[1]:
    tax=salary*3/100
elif salary > taxSlab.get(5)[0] and salary < taxSlab.get(5)[1]:
    tax=salary*5/100
elif salary > taxSlab.get(10)[0] and salary < taxSlab.get(10)[1]:
    tax=salary*10/100
else:
    tax=salary*20/100
netSalary=salary - tax
print("Your net salary is: ", netSalary)
print("Your tax liability is: ", tax)

Enter your salary: 25000
Your net salary is:  23750.0
Your tax liability is:  1250.0

In [322]:

marks=int(input("Enter marks: "))
if marks >= 90 and marks <= 100:
    print('A+')
elif marks >= 80 and marks <= 89:
    print('A')
elif marks >= 70 and marks <= 79:
    print('B')
elif marks >= 60 and marks <= 69:
    print('C')
else:
    print('Fail')

Enter marks: 55
Fail

In [323]:
principal=float(input("Enter the loan amount: "))
rate=float(input("Enter the rate of interest: "))
period=float(input("Enter the loan period: "))

si = principal * rate * period / 100
total = principal+si
emi = total/period
ci = principal * ((1+(rate/100))**(period/12))
print("Total payable : %s" %total)
print("EMI : %s" %emi)
print("Compound interest : %s" %ci)

Enter the loan amount: 10000
Enter the rate of interest: 5
Enter the loan period: 10
Total payable : 15000.0
EMI : 1500.0
Compound interest : 10414.96342698251

In [324]:
count = int(input("Enter repetition : "))
for i in range(0, count):
    print(i)

Enter repetition : 10
0
1
2
3
4
5
6
7
8
9

In [325]:
count = int(input("Enter repetition : "))
for i in range(0, count):
    print("hello!")

Enter repetition : 5
hello!
hello!
hello!
hello!
hello!

In [329]:
for i in range(0,len(taxSlab)):
    print(taxSlab.get(i))

None
None
None
[10000, 20000]

In [332]:
for i in range(1,6):
    print('*'*i)

*
**
***
****
*****

In [335]:
var = 5
while var >=0:
    print('*'*var)
    var = var-1

*****
****
***
**
*

In [336]:
num1 = int(input("Enter first number: "))
num2 = int(input("Enter second number: "))

def addition(a, b):
    return a+b

add = addition(num1, num2)
add

Enter first number: 5
Enter second number: 10

15

In [338]:
num1 = int(input("Enter first number: "))
num2 = int(input("Enter second number: "))
addition(num1, num2)

Enter first number: 20
Enter second number: 45

65

In [339]:
def subtract(a, b):
    return a-b

In [340]:
num1 = int(input("Enter first number: "))
num2 = int(input("Enter second number: "))
subtract(num1, num2)

Enter first number: 50
Enter second number: 25

25

In [12]:
try:
    any = int(input("Enter any number: "))
except ValueError as err:
    print("Your input isn't a number: ", err)

Enter any number: dfgdfg
Your input isn't a number:  invalid literal for int() with base 10: 'dfgdfg'

In [15]:
try:
    any = int(input("Enter any number: "))
    print("You entered: ", any)
except ValueError as err:
    print("Your input isn't a number: ", err)

Enter any number: 66546
You entered:  66546

# Lambda function

In [35]:
val1 = int(input("Enter any number: "))
val2 = int(input("Enter any number: "))
sum = lambda val1, val2: val1+val2
print(sum(val1, val2))

Enter any number: 45
Enter any number: 23
68

# Class

In [46]:
class Employee: "employee class"
desc=""

In [47]:
employee=Employee()

In [48]:
employee.name="Jennifer"
employee.desc="Real"

In [49]:
employee.name

'Jennifer'

In [50]:
employee.desc

'Real'

In [64]:
class Employee:
    def __init__(self, name, age, dept):
        self.name = name
        self.age = age
        self.dept = dept
        
    def printName(self):
        print("Age is :", self.age)
    
    def sayhi():
        print("hi")

emp1 = Employee("Jen", 30, "Tech");

print(emp1.name)
print(emp1.dept)
emp1.printName()

Jen
Tech
Age is : 30

In [65]:
Import Employee
class Printing:
    Employee.sayhi()

SyntaxError: invalid syntax (<ipython-input-65-3a7b4d417faf>, line 1)

# File

In [67]:
file = open("E:\Jennifer\myfile.txt","w")

In [71]:
file = open("E:\Jennifer\myfile.txt","w")
file.write("Hi, \n This is Jennifer's file!")

30

In [72]:
file = open("E:\Jennifer\myfile.txt","r")
file.read()

"Hi, \n This is Jennifer's file!"

In [163]:
file = open("E:\Jennifer\silly.txt","r")
words = file.read()
splitLines = words.split(" ")
len(splitLines)

wordsDict = {'mydict': 0}
for i in range(0, len(splitLines)):
    key = splitLines[i]
    key = key.replace(".", "").replace(",", "")
    if wordsDict.get(key) == None:
        count = 0;
    else:
        count = wordsDict.get(key)
    wordsDict.update({key.lower(): count+1})

wordsDict.pop('mydict')

file = open("E:\Jennifer\dict.txt","w")
dictToString = "%s"%sorted(wordsDict.items())
print(dictToString)
file.write(dictToString)

[('1932', 1), ('a', 3), ('ages', 1), ('albert', 1), ('all', 1), ('american', 1), ('answer', 1), ('appearance', 1), ('as', 1), ('being', 1), ('certain', 1), ('constantly', 1), ('cruise', 1), ('einstein', 1), ('every', 1), ('film', 1), ('in', 2), ("it's", 1), ('meanwhile', 1), ('multi-country', 1), ('not', 1), ('of', 3), ('paparazzi', 1), ('part', 1), ('people', 1), ('public', 1), ('questions', 1), ('sending', 1), ('so', 1), ('solace', 1), ('south', 1), ('stressful', 1), ('surprising', 1), ('that', 1), ('the', 2), ('to', 2), ('took', 1), ('trip', 1), ('trying', 1), ('was', 2), ('were', 1), ('winter', 1), ('you', 1), ('your', 1), ('–', 2)]

644

In [162]:
abc = "asdk"
abc = abc.replace("a","")
abc

'sdk'

# Numpy

In [1]:
import numpy as np

In [167]:
num = -345
np.abs(num)

345

In [179]:
arr = np.arange(0,10)
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [180]:
arr + arr

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [181]:
arr*arr

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [182]:
arr-arr

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [183]:
arr/arr

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [184]:
1/arr

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in true_divide
  """Entry point for launching an IPython kernel.

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111])

In [185]:
arr**2

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81], dtype=int32)

In [186]:
np.sqrt(9)

3.0

In [187]:
np.cbrt(27)

3.0

In [188]:
np.sqrt(arr)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [189]:
np.max(arr)

9

In [190]:
np.min(arr)

0

In [191]:
np.sum(arr)

45

In [193]:
np.count_nonzero(arr)

9

In [196]:
np.add(arr1,arr2)

ValueError: operands could not be broadcast together with shapes (5,) (3,)

In [198]:
np.arange(2.25, 12.45)

array([ 2.25,  3.25,  4.25,  5.25,  6.25,  7.25,  8.25,  9.25, 10.25,
       11.25, 12.25])

In [201]:
np.log(arr)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log
  """Entry point for launching an IPython kernel.

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

In [205]:
arrNeg=np.arange(-10, -1)

In [206]:
np.log(arrNeg)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in log
  """Entry point for launching an IPython kernel.

array([nan, nan, nan, nan, nan, nan, nan, nan, nan])

In [209]:
np.arange(0, 20).reshape(4,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [211]:
np.arange(0, 20, .5)

array([ 0. ,  0.5,  1. ,  1.5,  2. ,  2.5,  3. ,  3.5,  4. ,  4.5,  5. ,
        5.5,  6. ,  6.5,  7. ,  7.5,  8. ,  8.5,  9. ,  9.5, 10. , 10.5,
       11. , 11.5, 12. , 12.5, 13. , 13.5, 14. , 14.5, 15. , 15.5, 16. ,
       16.5, 17. , 17.5, 18. , 18.5, 19. , 19.5])

In [221]:
100*np.ones(4)

array([100., 100., 100., 100.])

In [224]:
np.linspace(0,101,10)

array([  0.        ,  11.22222222,  22.44444444,  33.66666667,
        44.88888889,  56.11111111,  67.33333333,  78.55555556,
        89.77777778, 101.        ])

In [231]:
mylist = [12,34,56,23,45]
myarr = np.array(mylist)
np.mean(myarr)

34.0

In [232]:
np.median(myarr)

34.0

In [237]:
np.eye(0)

array([], shape=(0, 0), dtype=float64)

In [238]:
np.random.rand()

0.2168012275389718

In [244]:
np.random.randint(100)

93

In [249]:
np.random.random(10)

array([0.49541816, 0.00882887, 0.78240098, 0.53030978, 0.93380105,
       0.33933378, 0.51555956, 0.67444741, 0.7614397 , 0.44901533])

In [258]:
arr = np.random.randint(1, 100, 5)
arr

array([60, 26, 50, 69, 62])

In [259]:
arr.max()

69

In [260]:
arr.min()

26

In [261]:
arr.argmax()

3

In [262]:
arr.argmin()

1

In [263]:
arr.shape

(5,)

In [264]:
arr.reshape(1,5)

array([[60, 26, 50, 69, 62]])

In [265]:
arr.reshape(5,1)

array([[60],
       [26],
       [50],
       [69],
       [62]])

In [266]:
arr.shape

(5,)

In [267]:
arr = np.random.randint(1, 100, 12)
arr

array([72, 82,  9, 49, 74,  7, 39, 98, 56, 27, 48, 36])

In [268]:
arr.shape

(12,)

In [269]:
arr.reshape(4,3)

array([[72, 82,  9],
       [49, 74,  7],
       [39, 98, 56],
       [27, 48, 36]])

In [270]:
arr.shape

(12,)

In [273]:
arr.put(2, 77)

In [274]:
arr

array([72, 82, 77, 49, 74,  7, 39, 98, 56, 27, 48, 36])

In [275]:
arr.dtype

dtype('int32')

In [286]:
var1, var2, var3 = [(x) for x in input("Enter three characters here: ").split()]

Enter three characters here: d g f

In [289]:
mylist = ['y', 'r']
string = '%s'%mylist
print(string)

['y', 'r']

In [6]:
arr = np.arange(1,101).reshape(10,10)/100

In [7]:
arr

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [14]:
arr = np.linspace(0,1,20)
arr

array([0.        , 0.05263158, 0.10526316, 0.15789474, 0.21052632,
       0.26315789, 0.31578947, 0.36842105, 0.42105263, 0.47368421,
       0.52631579, 0.57894737, 0.63157895, 0.68421053, 0.73684211,
       0.78947368, 0.84210526, 0.89473684, 0.94736842, 1.        ])

In [54]:
arr1 = np.arange(12,16)
arr2 = np.arange(17,21)
arr3 = np.arange(21,25)
arr = np.append(arr1,arr2)
arr = np.append(arr,arr3)
mat = arr.reshape(3,4)
mat

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [21, 22, 23, 24]])

In [79]:
arr = np.arange(12,27).reshape(3,5)
arr[:3,:4]

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

In [85]:
arr[:3,:1]

array([[12],
       [17],
       [22]])

In [95]:
arr[:3,2].reshape(3,1)

array([[14],
       [19],
       [24]])

In [105]:
col1 = arr[:3,:1]
col2 = arr[:3,2].reshape(3,1)
arr[1,3]

20

In [107]:
np.concatenate((col1, col2), axis=1)

array([[12, 14],
       [17, 19],
       [22, 24]])

In [108]:
arr.sum()

285

In [110]:
arr

array([[12, 13, 14, 15, 16],
       [17, 18, 19, 20, 21],
       [22, 23, 24, 25, 26]])

In [112]:
arr.std()

4.320493798938574

In [113]:
arr.cumsum()

array([ 12,  25,  39,  54,  70,  87, 105, 124, 144, 165, 187, 210, 234,
       259, 285], dtype=int32)

In [114]:
sum(arr)

array([51, 54, 57, 60, 63])

In [116]:
arr.sum(axis=0)

array([51, 54, 57, 60, 63])

In [117]:
arr.sum(axis=1)

array([ 70,  95, 120])

In [122]:
np.random.randint(0,4)

2

In [123]:
np.random.randint(0,4)

1

In [126]:
mylist = [3,4,5,6,7]
mylist[2]

5

# PANDAS

In [128]:
import pandas as pd

In [130]:
pd.Series(mylist)

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [131]:
len(mylist)

5

In [134]:
string = "abc"
list(len(string)*'*')

['*', '*', '*']

In [147]:
secretWords = ["rose", "thorn", "flower", "plant", "grow", "beautiful"]
secret = secretWords[np.random.randint(0,len(secretWords))]
print(secret)

grow

In [159]:
mydict = dict({'first' : 'Delhi', 'second' : 'Bangalore', 'third' : 'Mumbai'})

In [163]:
pd.Series(mydict.values(), index =mydict.keys())

first     (Delhi, Bangalore, Mumbai)
second    (Delhi, Bangalore, Mumbai)
third     (Delhi, Bangalore, Mumbai)
dtype: object

In [164]:
pd.Series(mydict)

first         Delhi
second    Bangalore
third        Mumbai
dtype: object

In [165]:
arr1

array([12, 13, 14, 15])

In [166]:
arr2

array([17, 18, 19, 20])

In [168]:
ser1 = pd.Series(arr1)
ser1

0    12
1    13
2    14
3    15
dtype: int32

In [169]:
ser2 = pd.Series(arr2)
ser2

0    17
1    18
2    19
3    20
dtype: int32

In [170]:
ser1 + ser2

0    29
1    31
2    33
3    35
dtype: int32

In [173]:
numdict1 = dict({'a' : 10, 'b' : 20, 'c' : 30})
numdict2 = dict({'a' : 100, 'b' : 200, 'c' : 300, 'd' : 45})
ser1 = pd.Series(numdict1)
ser2 = pd.Series(numdict2)
ser1 + ser2

a    110.0
b    220.0
c    330.0
d      NaN
dtype: float64

In [184]:
from numpy.random import randn
np.random.seed(101)

In [187]:
np.random.randn()

1.693722925204035

In [188]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.706086 -1.159119 -0.134841  0.390528
B  0.166905  0.184502  0.807706  0.072960
C  0.638787  0.329646 -0.497104 -0.754070
D -0.943406  0.484752 -0.116773  1.901755
E  0.238127  1.996652 -0.993263  0.196800

In [191]:
df['W']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: W, dtype: float64

In [198]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.706086 -1.159119 -0.134841  0.390528 -1.840927
B  0.166905  0.184502  0.807706  0.072960  0.974611
C  0.638787  0.329646 -0.497104 -0.754070  0.141683
D -0.943406  0.484752 -0.116773  1.901755 -1.060180
E  0.238127  1.996652 -0.993263  0.196800 -0.755137

In [199]:
df['new'] = 1000*df['W']
df

          W         X         Y         Z          new
A -1.706086 -1.159119 -0.134841  0.390528 -1706.085931
B  0.166905  0.184502  0.807706  0.072960   166.904636
C  0.638787  0.329646 -0.497104 -0.754070   638.787013
D -0.943406  0.484752 -0.116773  1.901755  -943.406403
E  0.238127  1.996652 -0.993263  0.196800   238.126959

In [218]:
names = ('Jen', 'John', 'Sean')
columns = ('Age', 'Dept', 'Salary')
values = [(23,'ITEC',20000),(26,'ITEC',25000),(21,'SGSS',27000)]
emp = pd.DataFrame(values, names, columns)
emp

      Age  Dept  Salary
Jen    23  ITEC   20000
John   26  ITEC   25000
Sean   21  SGSS   27000

In [219]:
emp['Salary']

Jen     20000
John    25000
Sean    27000
Name: Salary, dtype: int64

In [220]:
emp['Increment'] = (10,15,20)
emp

      Age  Dept  Salary  Increment
Jen    23  ITEC   20000         10
John   26  ITEC   25000         15
Sean   21  SGSS   27000         20

In [223]:
emp['New Salary'] = emp['Salary'] + ((emp['Increment'] * emp['Salary'])/100)
emp

      Age  Dept  Salary  Increment  New Salary
Jen    23  ITEC   20000         10     22000.0
John   26  ITEC   25000         15     28750.0
Sean   21  SGSS   27000         20     32400.0

In [232]:
emp.drop('Increment', axis=1, inplace=True)
emp

      Age  Dept  Salary  New Salary
Jen    23  ITEC   20000     22000.0
John   26  ITEC   25000     28750.0
Sean   21  SGSS   27000     32400.0

In [230]:
emp.drop('John', axis=0)

      Age  Dept  Salary  New Salary
Jen    23  ITEC   20000     22000.0
Sean   21  SGSS   27000     32400.0

In [231]:
emp.loc['Sean']

Age              21
Dept           SGSS
Salary        27000
New Salary    32400
Name: Sean, dtype: object

In [235]:
emp.iloc[0]

Age              23
Dept           ITEC
Salary        20000
New Salary    22000
Name: Jen, dtype: object

In [238]:
emp

      Age  Dept  Salary  New Salary
Jen    23  ITEC   20000     22000.0
John   26  ITEC   25000     28750.0
Sean   21  SGSS   27000     32400.0

In [241]:
emp.iloc[:2,:2]

      Age  Dept
Jen    23  ITEC
John   26  ITEC

In [242]:
emp.iloc[2:,:2]

      Age  Dept
Sean   21  SGSS

In [244]:
emp>=25000

        Age  Dept  Salary  New Salary
Jen   False  True   False       False
John  False  True    True        True
Sean  False  True    True        True

In [249]:
emp[emp['Salary']>=25000]

      Age  Dept  Salary  New Salary
John   26  ITEC   25000     28750.0
Sean   21  SGSS   27000     32400.0

In [252]:
emp['Salary']>=25000

Jen     False
John     True
Sean     True
Name: Salary, dtype: bool

In [253]:
emp[emp['Salary']>=25000]['Age']

John    26
Sean    21
Name: Age, dtype: int64

In [268]:
emp[(emp['Salary']>=25000) & (emp['Age']>22)][['Age','Dept','Salary']]

      Age  Dept  Salary
John   26  ITEC   25000

In [270]:
emp[(emp['Salary']>=25000) | (emp['Age']>22)][['Age','Dept','Salary']].loc['Jen']

Age          23
Dept       ITEC
Salary    20000
Name: Jen, dtype: object

In [288]:
emp.reset_index(inplace=True)
emp

   level_0 index  Age  Dept  Salary  New Salary
0        0   Jen   23  ITEC   20000     22000.0
1        1  John   26  ITEC   25000     28750.0
2        2  Sean   21  SGSS   27000     32400.0

In [277]:
df

          W         X         Y         Z          new
A -1.706086 -1.159119 -0.134841  0.390528 -1706.085931
B  0.166905  0.184502  0.807706  0.072960   166.904636
C  0.638787  0.329646 -0.497104 -0.754070   638.787013
D -0.943406  0.484752 -0.116773  1.901755  -943.406403
E  0.238127  1.996652 -0.993263  0.196800   238.126959

In [278]:
df.reset_index()

  index         W         X         Y         Z          new
0     A -1.706086 -1.159119 -0.134841  0.390528 -1706.085931
1     B  0.166905  0.184502  0.807706  0.072960   166.904636
2     C  0.638787  0.329646 -0.497104 -0.754070   638.787013
3     D -0.943406  0.484752 -0.116773  1.901755  -943.406403
4     E  0.238127  1.996652 -0.993263  0.196800   238.126959

In [289]:
emp

   level_0 index  Age  Dept  Salary  New Salary
0        0   Jen   23  ITEC   20000     22000.0
1        1  John   26  ITEC   25000     28750.0
2        2  Sean   21  SGSS   27000     32400.0

In [291]:
emp.drop(columns='level_0', inplace=True)

In [292]:
emp

  index  Age  Dept  Salary  New Salary
0   Jen   23  ITEC   20000     22000.0
1  John   26  ITEC   25000     28750.0
2  Sean   21  SGSS   27000     32400.0

In [293]:
emp.rename(columns={"index": "Name"})

   Name  Age  Dept  Salary  New Salary
0   Jen   23  ITEC   20000     22000.0
1  John   26  ITEC   25000     28750.0
2  Sean   21  SGSS   27000     32400.0

In [295]:
emp.rename(columns={"index": "Name"})

   Name  Age  Dept  Salary  New Salary
0   Jen   23  ITEC   20000     22000.0
1  John   26  ITEC   25000     28750.0
2  Sean   21  SGSS   27000     32400.0

In [296]:
emp.rename_axis('Index',1)

Index index  Age  Dept  Salary  New Salary
0       Jen   23  ITEC   20000     22000.0
1      John   26  ITEC   25000     28750.0
2      Sean   21  SGSS   27000     32400.0

In [297]:
emp.rename(columns={"index": "Name"}, inplace=True)

In [298]:
emp

   Name  Age  Dept  Salary  New Salary
0   Jen   23  ITEC   20000     22000.0
1  John   26  ITEC   25000     28750.0
2  Sean   21  SGSS   27000     32400.0

In [299]:
emp.rename_axis('Index',1, inplace=True)

In [300]:
emp

Index  Name  Age  Dept  Salary  New Salary
0       Jen   23  ITEC   20000     22000.0
1      John   26  ITEC   25000     28750.0
2      Sean   21  SGSS   27000     32400.0

In [302]:
emp.set_index('Dept')

Index  Name  Age  Salary  New Salary
Dept
ITEC    Jen   23   20000     22000.0
ITEC   John   26   25000     28750.0
SGSS   Sean   21   27000     32400.0

In [314]:
outside=['ITEC','ITEC', 'SGSS']
inside=['ITEC','ITEC','SGSS']
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [315]:
hier_index

MultiIndex(levels=[['ITEC', 'SGSS'], ['ITEC', 'SGSS']],
           labels=[[0, 0, 1], [0, 0, 1]])

In [321]:
emp.set_index(hier_index, inplace=True)

In [322]:
emp

Index      Name  Age  Dept  Salary  New Salary
ITEC ITEC   Jen   23  ITEC   20000     22000.0
     ITEC  John   26  ITEC   25000     28750.0
SGSS SGSS  Sean   21  SGSS   27000     32400.0

In [326]:
emp.reset_index()

Index level_0 level_1  Name  Age  Dept  Salary  New Salary
0        ITEC    ITEC   Jen   23  ITEC   20000     22000.0
1        ITEC    ITEC  John   26  ITEC   25000     28750.0
2        SGSS    SGSS  Sean   21  SGSS   27000     32400.0

In [339]:
emp.loc['ITEC'].iloc[1:,]

Index  Name  Age  Dept  Salary  New Salary
ITEC   John   26  ITEC   25000     28750.0

In [340]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [341]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [342]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [349]:
companyGrp = df.groupby('Company')
companyGrp

In [351]:
companyGrp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [353]:
companyGrp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [354]:
companyGrp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [355]:
companyGrp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [356]:
companyGrp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [357]:
companyGrp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [358]:
companyGrp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [364]:
    df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}, index = [0,1,2,3])

In [365]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']}, index = [4,5,6,7])

In [366]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [367]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [368]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']}, index = [8,9,10,11])

In [369]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [370]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [371]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [372]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']}, index = [4,5,6,7])

In [373]:
df3 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']}, index = [8,9,10,11])

In [374]:
pd.merge(df2, df3, on=['A'])

    A B_x C_x D_x  B_y  C_y  D_y
0  A4  B4  C4  D4   B8   C8   D8
1  A5  B5  C5  D5   B9   C9   D9
2  A6  B6  C6  D6  B10  C10  D10
3  A7  B7  C7  D7  B11  C11  D11

In [375]:
pd.merge(df2, df3, how='inner', on=['A'])

    A B_x C_x D_x  B_y  C_y  D_y
0  A4  B4  C4  D4   B8   C8   D8
1  A5  B5  C5  D5   B9   C9   D9
2  A6  B6  C6  D6  B10  C10  D10
3  A7  B7  C7  D7  B11  C11  D11

In [376]:
pd.merge(df2, df3, how='outer', on=['A'])

    A B_x C_x D_x  B_y  C_y  D_y
0  A4  B4  C4  D4   B8   C8   D8
1  A5  B5  C5  D5   B9   C9   D9
2  A6  B6  C6  D6  B10  C10  D10
3  A7  B7  C7  D7  B11  C11  D11

In [377]:
pd.merge(df2, df3, how='outer', on=['A', 'B'])

    A    B  C_x  D_x  C_y  D_y
0  A4   B4   C4   D4  NaN  NaN
1  A5   B5   C5   D5  NaN  NaN
2  A6   B6   C6   D6  NaN  NaN
3  A7   B7   C7   D7  NaN  NaN
4  A4   B8  NaN  NaN   C8   D8
5  A5   B9  NaN  NaN   C9   D9
6  A6  B10  NaN  NaN  C10  D10
7  A7  B11  NaN  NaN  C11  D11

In [378]:
pd.merge(df2, df3, how='inner', on=['A', 'B'])

Empty DataFrame
Columns: [A, B, C_x, D_x, C_y, D_y]
Index: []

In [379]:
pd.merge(df2, df3, how='left', on=['A', 'B'])

    A   B C_x D_x  C_y  D_y
0  A4  B4  C4  D4  NaN  NaN
1  A5  B5  C5  D5  NaN  NaN
2  A6  B6  C6  D6  NaN  NaN
3  A7  B7  C7  D7  NaN  NaN

In [380]:
pd.merge(df2, df3, how='right', on=['A', 'B'])

    A    B  C_x  D_x  C_y  D_y
0  A4   B8  NaN  NaN   C8   D8
1  A5   B9  NaN  NaN   C9   D9
2  A6  B10  NaN  NaN  C10  D10
3  A7  B11  NaN  NaN  C11  D11

In [385]:
df2.join(df3, lsuffix='A', how='inner')

Empty DataFrame
Columns: [AA, BA, CA, DA, A, B, C, D]
Index: []

In [386]:
df2.join(df3, lsuffix='A', how='outer')

     AA   BA   CA   DA    A    B    C    D
4    A4   B4   C4   D4  NaN  NaN  NaN  NaN
5    A5   B5   C5   D5  NaN  NaN  NaN  NaN
6    A6   B6   C6   D6  NaN  NaN  NaN  NaN
7    A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A4   B8   C8   D8
9   NaN  NaN  NaN  NaN   A5   B9   C9   D9
10  NaN  NaN  NaN  NaN   A6  B10  C10  D10
11  NaN  NaN  NaN  NaN   A7  B11  C11  D11

In [387]:
emp

Index      Name  Age  Dept  Salary  New Salary
ITEC ITEC   Jen   23  ITEC   20000     22000.0
     ITEC  John   26  ITEC   25000     28750.0
SGSS SGSS  Sean   21  SGSS   27000     32400.0

In [388]:
emp['Dept'].unique()

array(['ITEC', 'SGSS'], dtype=object)

In [389]:
emp['Dept'].nunique()

2

In [390]:
emp['Dept'].value_counts()

ITEC    2
SGSS    1
Name: Dept, dtype: int64

In [391]:
def decrement(x):
    return x-500

In [395]:
emp['Salary'].apply(decrement)

ITEC  ITEC    19500
      ITEC    24500
SGSS  SGSS    26500
Name: Salary, dtype: int64

In [400]:
new = emp['Salary'].apply(decrement)
emp['Salary'] = new

In [401]:
emp

Index      Name  Age  Dept  Salary  New Salary
ITEC ITEC   Jen   23  ITEC   19500     22000.0
     ITEC  John   26  ITEC   24500     28750.0
SGSS SGSS  Sean   21  SGSS   26500     32400.0

In [402]:
emp.sort_values(by='Salary',ascending=False)

Index      Name  Age  Dept  Salary  New Salary
SGSS SGSS  Sean   21  SGSS   26500     32400.0
ITEC ITEC  John   26  ITEC   24500     28750.0
     ITEC   Jen   23  ITEC   19500     22000.0

In [405]:
df2.join(df3, lsuffix='A', how='outer').fillna('-')

    AA  BA  CA  DA   A    B    C    D
4   A4  B4  C4  D4   -    -    -    -
5   A5  B5  C5  D5   -    -    -    -
6   A6  B6  C6  D6   -    -    -    -
7   A7  B7  C7  D7   -    -    -    -
8    -   -   -   -  A4   B8   C8   D8
9    -   -   -   -  A5   B9   C9   D9
10   -   -   -   -  A6  B10  C10  D10
11   -   -   -   -  A7  B11  C11  D11

In [410]:
df = pd.read_excel("E:\Jennifer\Excel_Sample.xlsx")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [412]:
df1 = pd.read_csv("example")
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [413]:
df = pd.read_excel("E:\Jennifer\Excel_Sample.xlsx", sheetName='Sheet1')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [414]:
df.to_csv("example", index=False)

In [415]:
df1 = pd.read_csv("example")
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [417]:
df1.to_excel("E:\Jennifer\Excel_Sample.xlsx", sheet_name='Sheet1')

In [418]:
df = pd.read_excel("E:\Jennifer\Excel_Sample.xlsx", sheetName='Sheet1')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [425]:
user =pd.read_csv("u.user", sep=",")
user

    num,age,gender,profession,salary
0            1,24,M,technician,85711
1                 2,53,F,other,94043
2                3,23,M,writer,32067
3            4,24,M,technician,43537
4                 5,33,F,other,15213
5             6,42,M,executive,98101
6         7,57,M,administrator,91344
7         8,36,M,administrator,05201
8               9,29,M,student,01002
9               10,53,M,lawyer,90703
10               11,39,F,other,30329
11               12,28,F,other,06405
12            13,47,M,educator,29206
13           14,45,M,scientist,55106
14            15,49,F,educator,97301
15       16,21,M,entertainment,10309
16          17,30,M,programmer,06355
17               18,35,F,other,37212
18           19,40,M,librarian,02138
19           20,42,F,homemaker,95660
20              21,26,M,writer,30068
21              22,25,M,writer,40206
22              23,30,F,artist,48197
23              24,21,F,artist,94533
24            25,39,M,engineer,55107
25            26,49,M,engineer,21044
26           27,40,F,librarian,30030
27              28,32,M,writer,55369
28          29,41,M,programmer,94043
29              30,7,M,student,55436
..                               ...
913             914,44,F,other,08105
914     915,50,M,entertainment,60614
915          916,27,M,engineer,N2L5N
916           917,22,F,student,20006
917         918,40,M,scientist,70116
918             919,25,M,other,14216
919            920,30,F,artist,90008
920           921,20,F,student,98801
921     922,29,F,administrator,21114
922           923,21,M,student,E2E3R
923             924,29,M,other,11753
924          925,18,F,salesman,49036
925     926,49,M,entertainment,01701
926        927,23,M,programmer,55428
927           928,21,M,student,55408
928         929,44,M,scientist,53711
929         930,28,F,scientist,07310
930          931,60,M,educator,33556
931          932,58,M,educator,06437
932           933,28,M,student,48105
933          934,61,M,engineer,22902
934            935,42,M,doctor,66221
935             936,24,M,other,32789
936          937,48,M,educator,98072
937        938,38,F,technician,55038
938           939,26,F,student,33319
939     940,32,M,administrator,02215
940           941,20,M,student,97229
941         942,48,F,librarian,78209
942           943,22,M,student,77841

[943 rows x 1 columns]

In [432]:
html = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")
html

[                                             Bank Name                City  \
 0                  Washington Federal Bank for Savings             Chicago
 1      The Farmers and Merchants State Bank of Argonia             Argonia
 2                                  Fayette County Bank          Saint Elmo
 3    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 4                                       First NBC Bank         New Orleans
 5                                        Proficio Bank  Cottonwood Heights
 6                        Seaway Bank and Trust Company             Chicago
 7                               Harvest Community Bank          Pennsville
 8                                          Allied Bank            Mulberry
 9                         The Woodbury Banking Company            Woodbury
 10                              First CornerStone Bank     King of Prussia
 11                                  Trust Company Bank             Memphis
 12                          North Milwaukee State Bank           Milwaukee
 13                              Hometown National Bank            Longview
 14                                 The Bank of Georgia      Peachtree City
 15                                        Premier Bank              Denver
 16                                      Edgebrook Bank             Chicago
 17                              Doral Bank  En Espanol            San Juan
 18                   Capitol City Bank & Trust Company             Atlanta
 19                             Highland Community Bank             Chicago
 20                    First National Bank of Crestview           Crestview
 21                                  Northern Star Bank             Mankato
 22              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 23               The National Republic Bank of Chicago             Chicago
 24                                      NBRS Financial          Rising Sun
 25                               GreenChoice Bank, fsb             Chicago
 26                            Eastside Commercial Bank             Conyers
 27                              The Freedom State Bank             Freedom
 28                                         Valley Bank     Fort Lauderdale
 29                                         Valley Bank              Moline
 ..                                                 ...                 ...
 525                                  ANB Financial, NA         Bentonville
 526                                          Hume Bank                Hume
 527                             Douglass National Bank         Kansas City
 528                                  Miami Valley Bank            Lakeview
 529                                            NetBank          Alpharetta
 530                          Metropolitan Savings Bank          Pittsburgh
 531                                    Bank of Ephraim             Ephraim
 532                                      Reliance Bank        White Plains
 533              Guaranty National Bank of Tallahassee         Tallahassee
 534                                Dollar Savings Bank              Newark
 535                               Pulaski Savings Bank        Philadelphia
 536              First National Bank of Blanchardville      Blanchardville
 537                              Southern Pacific Bank            Torrance
 538                        Farmers Bank of Cheneyville         Cheneyville
 539                                      Bank of Alamo               Alamo
 540             AmTrade International Bank  En Espanol             Atlanta
 541                     Universal Federal Savings Bank             Chicago
 542                       Connecticut Bank of Commerce            Stamford
 543                                   New Century Bank     Shelby Township
 544                              Net 1st National Bank          Boca Raton
 545                                       NextBank, NA             Phoenix
 546                           Oakwood Deposit Bank Co.             Oakwood
 547                              Bank of Sierra Blanca       Sierra Blanca
 548                      Hamilton Bank, NA  En Espanol               Miami
 549                             Sinclair National Bank            Gravette
 550                                 Superior Bank, FSB            Hinsdale
 551                                Malta National Bank               Malta
 552                    First Alliance Bank & Trust Co.          Manchester
 553                  National State Bank of Metropolis          Metropolis
 554                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    IL  30570                   Royal Savings Bank   December 15, 2017
 1    KS  17719                          Conway Bank    October 13, 2017
 2    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 3    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 4    LA  58302                         Whitney Bank      April 28, 2017
 5    UT  35495                    Cache Valley Bank       March 3, 2017
 6    IL  19328                  State Bank of Texas    January 27, 2017
 7    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 8    AR     91                         Today's Bank  September 23, 2016
 9    GA  11297                          United Bank     August 19, 2016
 10   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 11   TN   9956           The Bank of Fayette County      April 29, 2016
 12   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 13   WA  35156                       Twin City Bank     October 2, 2015
 14   GA  35259                        Fidelity Bank     October 2, 2015
 15   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 16   IL  57772             Republic Bank of Chicago         May 8, 2015
 17   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 18   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 19   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 20   FL  17557                       First NBC Bank    January 16, 2015
 21   MN  34983                            BankVista   December 19, 2014
 22   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 23   IL    916                  State Bank of Texas    October 24, 2014
 24   MD   4862                          Howard Bank    October 17, 2014
 25   IL  28462                 Providence Bank, LLC       July 25, 2014
 26   GA  58125            Community & Southern Bank       July 18, 2014
 27   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 28   FL  21793  Landmark Bank, National Association       June 20, 2014
 29   IL  10450                  Great Southern Bank       June 20, 2014
 ..   ..    ...                                  ...                 ...
 525  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 526  MO   1971                        Security Bank       March 7, 2008
 527  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 528  OH  16848         The Citizens Banking Company     October 4, 2007
 529  GA  32575                           ING DIRECT  September 28, 2007
 530  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 531  UT   1249                        Far West Bank       June 25, 2004
 532  NY  26778                     Union State Bank      March 19, 2004
 533  FL  26838              Hancock Bank of Florida      March 12, 2004
 534  NJ  31330                          No Acquirer   February 14, 2004
 535  PA  27203                       Earthstar Bank   November 14, 2003
 536  WI  11639                        The Park Bank         May 9, 2003
 537  CA  27094                            Beal Bank    February 7, 2003
 538  LA  16445            Sabine State Bank & Trust   December 17, 2002
 539  TN   9961                          No Acquirer    November 8, 2002
 540  GA  33784                          No Acquirer  September 30, 2002
 541  IL  29355               Chicago Community Bank       June 27, 2002
 542  CT  19183                   Hudson United Bank       June 26, 2002
 543  MI  34979                          No Acquirer      March 28, 2002
 544  FL  26652                       Bank Leumi USA       March 1, 2002
 545  AZ  22314                          No Acquirer    February 7, 2002
 546  OH   8966       The State Bank & Trust Company    February 1, 2002
 547  TX  22002     The Security State Bank of Pecos    January 18, 2002
 548  FL  24382     Israel Discount Bank of New York    January 11, 2002
 549  AR  34248                   Delta Trust & Bank   September 7, 2001
 550  IL  32646                Superior Federal, FSB       July 27, 2001
 551  OH   6629                    North Valley Bank         May 3, 2001
 552  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 553  IL   3815              Banterra Bank of Marion   December 14, 2000
 554  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0     February 21, 2018
 1     February 21, 2018
 2         July 26, 2017
 3        March 22, 2018
 4      December 5, 2017
 5         March 7, 2018
 6          May 18, 2017
 7          May 18, 2017
 8    September 25, 2017
 9          June 1, 2017
 10    September 6, 2016
 11    September 6, 2016
 12       March 13, 2017
 13    February 19, 2018
 14     October 24, 2016
 15    February 20, 2018
 16        July 12, 2016
 17         May 13, 2015
 18       April 21, 2015
 19    November 15, 2017
 20    November 15, 2017
 21      January 3, 2018
 22    November 10, 2016
 23      January 6, 2016
 24    February 19, 2018
 25    December 12, 2016
 26      October 6, 2017
 27    February 21, 2018
 28    February 14, 2018
 29        June 26, 2015
 ..                  ...
 525     August 28, 2012
 526     August 28, 2012
 527    October 26, 2012
 528  September 12, 2016
 529     August 28, 2012
 530    October 27, 2010
 531       April 9, 2008
 532       April 9, 2008
 533      April 17, 2018
 534       April 9, 2008
 535     October 6, 2017
 536        June 5, 2012
 537    October 20, 2008
 538    October 20, 2004
 539      March 18, 2005
 540  September 11, 2006
 541     October 6, 2017
 542   February 14, 2012
 543      March 18, 2005
 544       April 9, 2008
 545    February 5, 2015
 546    October 25, 2012
 547    November 6, 2003
 548  September 21, 2015
 549     October 6, 2017
 550     August 19, 2014
 551   November 18, 2002
 552   February 18, 2003
 553      March 17, 2005
 554      March 17, 2005

 [555 rows x 7 columns]]

In [433]:
from sqlalchemy import create_engine

In [434]:
engine = create_engine('sqlite:///:memory:')

In [435]:
df.to_sql('data', engine)

In [436]:
sql_df=pd.read_sql('data',con=engine)

In [437]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [438]:
df.to_sql('mydata', engine)

In [439]:
sql_df=pd.read_sql('mydata',con=engine)

In [440]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [441]:
emp.to_sql('Employee', engine)

In [442]:
sql_emp=pd.read_sql('Employee',con=engine)
sql_emp

  level_0 level_1  Name  Age  Dept  Salary  New Salary
0    ITEC    ITEC   Jen   23  ITEC   19500     22000.0
1    ITEC    ITEC  John   26  ITEC   24500     28750.0
2    SGSS    SGSS  Sean   21  SGSS   26500     32400.0

In [446]:
sql_emp.drop(columns='level_0',inplace=True)

In [447]:
sql_emp.drop(columns='level_1',inplace=True)

In [448]:
sql_emp

   Name  Age  Dept  Salary  New Salary
0   Jen   23  ITEC   19500     22000.0
1  John   26  ITEC   24500     28750.0
2  Sean   21  SGSS   26500     32400.0